reddit_app/app/controllers/subs_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "new_sub"], ["description", "subway"], ["moderator_id", 14], ["created_at", "2021-04-12 19:29:43.431656"], ["updated_at", "2021-04-12 19:29:43.431656"]]
---
    def create
        @sub = Sub.new(sub_params)
        @sub.moderator_id = User.find(params[:moderator_id])
        if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["title", "coolestsub"], ["updated_at", "2021-04-12 19:33:02.896475"], ["id", 2]]
---
    def update
        @sub = Sub.find(params[:id])

        if @sub.moderator_id == current_user.id
            if @sub.update_attributes(sub_params)