reddit_app/app/controllers/users_controller.rb

    def update
        @user = User.find(params[:id])

        if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "bob1234"], ["password_digest", "$2a$12$GxbrqfqG8PBSwndirSwIi.TcwHAYjYUqxfDHHt7G72TroRuxqkDgG"], ["updated_at", "2021-04-12 17:48:23.225507"], ["id", 12]]