reddit_app/app/models/user.rb

    def reset_session_token!
        self.session_token = User.generate_session_token
        self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "Z30BPmibINWMOJlsACz0VA"], ["updated_at", "2021-04-12 15:52:43.163710"], ["id", 1]]